const nameDetails = {
    name: "Isabella",
    gener: "Female"
    meaning: "Promesa de Dios",
    origin: "Hebreo",
    popularIn: "Brasil, Ecuador, Colombia",
    description:
      'Isabella es un nombre propio femenino de origen Hebreo.  "Promesa de Dios". Es posible que derive del nombre de la diosa egipcia Isis, reina de los dioses.',
    detailedDescription:
      'Una hipótesis poco probable afirma que proviene del latín «Isis bella» («"Isabella"» en italiano moderno), en honor a la diosa egipcia de la fecundidad Isis, cuyo culto era muy popular entre los soldados romanos, más el epíteto «bella», subrayando su feminidad. Al parecer, se habría ocultado el origen pagano del nombre presentándolo como una variante del hebreo אֱלִישֶׁבַע (Elīshebha o Elisabet) que significa ‘juramento de Dios’, ‘promesa de Dios’ o ‘Dios es mi juramento’.',
    history:
      "Se refiere a la combinación del nombre de la diosa egipcia Isis, y Bel el principal dios babilónico. Otra raíz etimológica para "Isabel" es su procedencia del vocablo «Ish-baal», que significa «hija de Baal», siendo Baal la principal deidad de los cananeos.",
    variants: ["Chabela (en español), Belle (en francés), Bettina (en italiano)"],
    famousPersons: [
      "Isabella Rosellini (actriz italiana)",
      "Isabella Santiago (actriz venezolana)",
    ],
    nameDay: "17 de noviembre (en algunos países católicos)",
    popularity: {
      global:
        "Muy popular en países de habla hispana y en muchos otros países de europa",
      trend: "Ha bajado la popularidad en las últimas décadas",
    },
  };
  const nameDetails = {
    name: "Valentina",
    gener: "Female"
    meaning: "Valiente",
    origin: "Latín",
    popularIn: "Perú, Colombia, Bolivia",
    description:
      'Valentina es un nombre propio femenino de origen Latín.  "Valiente". es un nombre propio femenino originado en el nombre masculino Valentinus, que en el antiguo idioma latín (hablado en el Imperio Romano) significaba: persona valiente, líder, sociable, activa y vigorosa. Su variante masculino es Valentín.',
    detailedDescription:
      'Su significado se refiere al amor, el amar, el corazón, la pasión, el enamoramiento, la eterna felicidad, entre otros. Muchos de sus valores están personificados en Santa Valentina de Alejandría, unigénita nacida en Varsovia, Polonia, fallecida en Moscú, Rusia, y beatificada por el Papa en 1699, quien comenzara leyendo el Corán y después fuese traductora de la Biblia, licenciada en idiomas ruso, inglés y español.',
    history:
      "Valentinus, de origen latino, se traduce como “vigoroso”, “robusto” o “sano”. Durante esa época, hubo destacados personajes con ese nombre, como Valentinus el gnóstico, un sabio que vivió en Egipto durante el siglo I a.C.",
    variants: ["Vale, Val, Valen, Valila, Valita, Valu, Vali, Valia, Vatina, Tina, Titinilla, Tinilla, Tinita, Valencia, Valenchu, Valecita, tona."],
    famousPersons: [
      "Valentina Acosta (actriz colombiana)",
      "Valentina Carro (actriz, poeta, diseñadora y escritora gallega)",
    ],
    nameDay: "25 de julio (en algunos países católicos)",
    popularity: {
      global:
        "Muy popular en países de habla inglesa y en otros países de europa",
      trend: "Se ha incrementado la popularidad en los últimos dos años",
    },
  };
  const nameDetails = {
    name: "Emma ",
    gener: "Female"
    meaning: "Universal",
    origin: "Germánico",
    popularIn: "Países nórdicos y países de habla inglesa y francesa.",
    description:
      'Emma es un nombre propio femenino de origen Germánico.  "Universal". es un nombre propio de origen germano (Ermin) que significa "entera" o "universal". En los países de habla inglesa (en los que se pronuncia "ema", con una sola eme) es uno de los nombres de mujer más comunes y extendidos',
    detailedDescription:
      'fue el nombre femenino más popular en Estados Unidos en 2008. En España, según el INE, en 2014 había 22.558 personas con ese nombre, indicando el dato además que es uno de los nombres que más se está extendiendo en el país -ya que la edad media de esas personas era de apenas 18 años.',
    history:
      "Emma es un nombre de origen germánico que deriva del vocablo Ermin, cuya raíz, 'Erm', se traduce como “completo” o “grande”, por lo que el significado de Emma es “gran fuerza” o “aquella que tiene una gran fortaleza",
    variants: ["Erminia,Emily,Emmanuela"],
    famousPersons: [
      "Emma Roberts (actriz estadounidense)",
      "Emma Watson (actriz británica)",
    ],
    nameDay: "25 de junio (en algunos países católicos)",
    popularity: {
      global:
        "Muy popular en países de habla inglesa principalmente",
      trend: "Extremadamente popular",
    },
  };
  const nameDetails = {
    name: "Mia ",
    gener: "Female"
    meaning: "Elegida",
    origin: "Hebreo",
    popularIn: "Múltiples lugares.",
    description:
      'Mia es un nombre propio femenino de origen Hebreo.  "Elegida". Mia es hoy en día un nombre muy popular en distintas culturas. Es sencillo, directo y atractivo, por lo que ha tenido un ascenso meteórico en la lista de los nombres más frecuentes.',
    detailedDescription:
      'El nombre Mía estuvo entre los 10 más elegidos para las niñas en Alemania, estudio realizado el 4 de febrero de 2006. En los países hispanohablantes es común también la forma Mía escrita con tilde, la cual tiene el mismo significado que el pronombre posesivo',
    history:
      "El verdadero origen del nombre de Mía es hebreo, y es diminutivo de María. Significa 'la elegida', 'la amada por Dios'. De naturaleza emotiva, diligente, cuidadosa, expresiva y consecuente.",
    variants: ["Maia, Maija, Maja, Maya, Miia, Miya, Miyah, Mya, Myah,Miaah"],
    famousPersons: [
      "Mía Farrow (actriz estadounidense)",
      "Mia Mottley (politica británica)",
    ],
    nameDay: "12 de septiembre (en algunos países católicos)",
    popularity: {
      global:
        "Muy popular en Inglaterra, Estados Unidos y Alemania",
      trend: "Muy popular",
    },
  };

  const nameDetails = {
    name: "Camila",
    gener: "Female",
    meaning: "Joven ceremonial",
    origin: "Latino",
    popularIn: "Múltiples lugares.",
    description:
      'Camila es un nombre femenino de origen latino que significa "joven ceremonial". Es un nombre elegante y lleno de gracia, ampliamente utilizado.',
    detailedDescription:
      'En muchos países de habla hispana, Camila ha sido uno de los nombres más populares en los últimos años, especialmente en la última década.',
    history:
      "Camila tiene raíces en el latín 'camillus', que se refería a un asistente en ceremonias religiosas. Es un nombre que simboliza nobleza y espiritualidad.",
    variants: ["Camilia, Kamila, Kamy"],
    famousPersons: [
      "Camila Cabello (cantante cubano-estadounidense)",
      "Camila Mendes (actriz estadounidense)",
    ],
    nameDay: "14 de enero",
    popularity: {
      global: "Muy popular en América Latina",
      trend: "En aumento",
    },
};

const nameDetails = {
    name: "Lucía",
    gener: "Female",
    meaning: "Luz",
    origin: "Latino",
    popularIn: "Múltiples lugares.",
    description:
      'Lucía es un nombre femenino de origen latino que significa "luz". Es un nombre clásico que evoca claridad y luminosidad.',
    detailedDescription:
      'Lucía ha sido un nombre ampliamente utilizado en muchos países, especialmente en los de habla hispana, donde ha mantenido su popularidad a lo largo de los años.',
    history:
      "El nombre Lucía proviene del latín 'lux', que significa luz. Ha sido llevado por numerosas santas, lo que ha contribuido a su popularidad.",
    variants: ["Lucia, Luce, Lucie"],
    famousPersons: [
      "Lucía González (escritora colombiana)",
      "Lucía Méndez (actriz mexicana)",
    ],
    nameDay: "13 de diciembre",
    popularity: {
      global: "Popular en España y América Latina",
      trend: "Estable",
    },
};

const nameDetails = {
    name: "Elena",
    gener: "Female",
    meaning: "Brillante, resplandeciente",
    origin: "Griego",
    popularIn: "Europa y America Latina.",
    description:
      'Elena es un nombre femenino de origen griego que significa "brillante" o "resplandeciente". Su elegancia lo ha convertido en un nombre favorito a lo largo de los siglos.',
    detailedDescription:
      'En la actualidad, Elena sigue siendo un nombre común en muchas culturas, especialmente en países europeos y latinoamericanos.',
    history:
      "Elena proviene del griego 'helene', que se asocia con la luz. Ha sido un nombre popular desde la antigüedad, asociado a la mitología y la literatura.",
    variants: ["Helena, Alena, Ilena"],
    famousPersons: [
      "Elena Poniatowska (escritora mexicana)",
      "Elena Ferrante (autora italiana)",
    ],
    nameDay: "18 de agosto",
    popularity: {
      global: "Popular en Europa y América Latina",
      trend: "En aumento en paises de habla hispana",
    },
};

const nameDetails7 = {
    name: "Ariadna",
    gener: "Female",
    meaning: "La más sagrada",
    origin: "Griego",
    popularIn: "Paises occidentales.",
    description:
      'Ariadna es un nombre femenino de origen griego que significa "la más sagrada". Es un nombre poco común pero con un significado profundo.',
    detailedDescription:
      'Ariadna ha ganado popularidad en los últimos años, especialmente en países de habla hispana, siendo elegido por su sonoridad y significado.',
    history:
      "El nombre tiene raíces en la mitología griega, donde Ariadna era la hija de Minos. Su historia se relaciona con el mito del Laberinto y el Minotauro.",
    variants: ["Ariadne, Ariadna, Riana"],
    famousPersons: [
      "Ariadna Gutiérrez (modelo colombiana)",
      "Ariadna M. (influencer y cantante)",
    ],
    nameDay: "17 de julio",
    popularity: {
      global: "En crecimiento en América Latina",
      trend: "Ha crecido en la zona occidental del mundo",
    },
};

const nameDetails = {
    name: "Natalia",
    gener: "Female",
    meaning: "Nacida en Navidad",
    origin: "Latino",
    popularIn: "Paises europeos, principalmente católicos.",
    description:
      'Natalia es un nombre femenino de origen latino que significa "nacida en Navidad". Es un nombre muy utilizado en el mundo hispanohablante.',
    detailedDescription:
      'La popularidad de Natalia ha crecido constantemente, especialmente en épocas navideñas, y es común en muchos países latinoamericanos.',
    history:
      "El nombre proviene del latín 'natalis', que se refiere al nacimiento. Se ha utilizado desde la Edad Media y tiene connotaciones cristianas.",
    variants: ["Natália, Natalia, Talia"],
    famousPersons: [
      "Natalia Oreiro (actriz uruguaya)",
      "Natalia Lafourcade (cantante mexicana)",
    ],
    nameDay: "25 de diciembre",
    popularity: {
      global: "Popular en América Latina y España",
      trend: "Estable",
    },
};

const nameDetails = {
    name: "Bianca",
    gener: "Female",
    meaning: "Blanca",
    origin: "Italiano",
    popularIn: "Múltiples lugares.",
    description:
      'Bianca es un nombre femenino de origen italiano que significa "blanca". Es un nombre que evoca pureza y simplicidad.',
    detailedDescription:
      'Bianca ha tenido un auge en popularidad en diversos países, especialmente en Italia y entre comunidades de habla hispana.',
    history:
      "El nombre Bianca proviene del italiano y se ha utilizado desde la Edad Media. Simboliza la inocencia y la belleza.",
variants: ["Bianka, Blanca"],
famousPersons: [   
"Bianca Jagger (activista nicaragüense)",
"Bianca Lawson (actriz estadounidense)",
    ],
nameDay: "17 de enero",
popularity: {
global: "Popular en Italia y América Latina",
trend: "No ha tenido variación en los últimos años",
    },
};

const nameDetails = {
name: "Clara",
gener: "Female",
meaning: "Brillante, clara",
origin: "Latino",
popularIn: "Múltiples lugares.",
description:
      'Clara es un nombre femenino de origen latino que significa "brillante" o "clara". Es un nombre clásico que evoca claridad y luminosidad.',
detailedDescription:
      'Clara ha sido un nombre apreciado en muchas culturas, especialmente en Europa y América Latina, donde ha mantenido su popularidad.',
history:
      "El nombre proviene del latín 'clarus', que significa brillante. Ha sido llevado por muchas santas y personajes históricos a lo largo de la historia.",
    variants: ["Claire, Klara"],
famousPersons: [
"Clara Schumann (pianista y compositora alemana)",
"Clara Lago (actriz española)",
    ],
nameDay: "11 de agosto",
popularity: {
global: "Popular en Europa y América Latina",
trend: "Aumentó en los últimos dos años",
    },
};

const nameDetails = {
name: "Mariana",
gener: "Female",
meaning: "Gracia y mar",
origin: "Latino",
popularIn: "Múltiples lugares.",
description:
'Mariana es un nombre femenino de origen latino que combina los significados de "gracia" y "mar". Es un nombre que se asocia con la elegancia y la fluidez.',
detailedDescription:
'Mariana ha mantenido su popularidad en muchos países de habla hispana, siendo un nombre preferido por su sonoridad y significado.',
history:
"El nombre Mariana es una combinación de María y Ana, dos nombres que han sido venerados en la tradición cristiana.",
variants: ["Marianna, Mariana, Mariane"],
famousPersons: [
"Mariana di Girolamo (actriz chilena)",
"Mariana Enríquez (escritora argentina)",
    ],
nameDay: "16 de julio",
popularity: {
global: "Popular en América Latina",
trend: "En descenso",
    },
};

const nameDetails = {
name: "Renata",
gener: "Female",
meaning: "Renacida",
origin: "Latino",
popularIn: "Múltiples lugares.",
description:
'Renata es un nombre femenino de origen latino que significa "renacida". Es un nombre que simboliza nuevos comienzos y oportunidades.',
detailedDescription:
      'Renata ha sido un nombre relativamente común en países de habla hispana y en Europa, donde ha experimentado un ligero aumento en popularidad.',
history:
      "El nombre Renata proviene del latín 'renatus', que se refiere a alguien que ha renacido. Es un nombre que ha sido utilizado en contextos religiosos y culturales.",
variants: ["Renatta, Renate"],
famousPersons: [
"Renata Litvinova (actriz rusa)",
"Renata Klein (personaje de televisión)",
    ],
nameDay: "5 de diciembre",
popularity: {
      global: "En Europa y América Latina",
trend: "Estable",
    },
};

const nameDetails = {
name: "Tatiana",
gener: "Female",
meaning: "Reina de los héroes",
origin: "Latino/Ruso",
popularIn: "Múltiples lugares.",
description:
'Tatiana es un nombre femenino que significa "reina de los héroes". Es un nombre que ha tenido un significado noble a lo largo de la historia.',
detailedDescription:
      'Tatiana es un nombre común en Rusia y ha sido adoptado en muchas culturas, especialmente en Europa del Este.',
history:
      "El nombre proviene de la antigua Roma y ha sido llevado por numerosas figuras históricas y culturales a lo largo de los siglos.",
variants: ["Tatjana, Tatyana"],
famousPersons: [
"Tatiana Maslany (actriz canadiense)",
"Tatiana de Rosnay (autora francesa)",
    ],
nameDay: "12 de enero",
popularity: {
      global: "Popular en Rusia y Europa del Este",
      trend: "Ha aumentado en relación a la última década",
    },
};

const nameDetails = {
name: "Diana",
gener: "Female",
meaning: "Divina",
origin: "Latino",
popularIn: "Múltiples lugares.",
description:
      'Diana es un nombre femenino de origen latino que significa "divina". Es un nombre asociado a la mitología y la realeza.',
detailedDescription:
'Diana ha sido un nombre querido en muchas culturas, especialmente en los países de habla hispana y en el mundo angloparlante.',
history:
      "El nombre Diana proviene de la diosa romana de la caza y la luna. Es un símbolo de independencia y poder femenino.",
variants: ["Diana, Dany"],
famousPersons: [
"Diana, Princesa de Gales",
"Diana Krall (cantante de jazz canadiense)",
nameDay: "9 de junio",
popularity: {
global: "Popular en todo el mundo",
      trend: "Estable",
    },
};

const nameDetails = {
      name: "Luz",
      gener: "Female",
      meaning: "Brillo, claridad.",
      origin: "Latino",
      popularIn: "Múltiples lugares, especialmente en países de habla hispana.",
      description: 
        'Luz es un nombre femenino que simboliza la luz y la claridad. Se asocia con la esperanza y la vida.',
      detailedDescription: 
        'El nombre Luz es muy común en la cultura hispana y se utiliza frecuentemente por su significado positivo y su conexión espiritual.',
      history: 
        "El nombre Luz tiene raíces en la religión y la espiritualidad, a menudo asociado con la luz divina.",
      variants: ["Lucía", "Luzia"],
      famousPersons: [
        "Luz María Doria (productora de televisión)",
        "Luz Elena González (actriz mexicana)"
      ],
      nameDay: "13 de diciembre",
      popularity: {
        global: "Moderadamente popular",
        trend: "En disminución de la última década",
      },
    },

const nameDetails = {
      name: "Mariana",
      gener: "Female",
      meaning: "Estrella del mar.",
      origin: "Latino",
      popularIn: "Común en países de habla hispana y portuguesa.",
      description: 
        'Mariana es un nombre femenino que combina la fuerza de María y Ana, simbolizando la belleza y la gracia.',
      detailedDescription: 
        'Este nombre es apreciado por su sonoridad y su significado relacionado con el mar, evocando imágenes de tranquilidad y vastedad.',
      history: 
        "Mariana es un nombre que ha sido utilizado desde la Edad Media y está vinculado a diversas figuras religiosas.",
      variants: ["Marianna", "Marina"],
      famousPersons: [
        "Mariana de la Torre (actriz)",
        "Mariana Enriquez (escritora)"
      ],
      nameDay: "17 de julio",
      popularity: {
        global: "Popular en el mundo hispanohablante",
        trend: "Estable",
      },
    },

const nameDetails = {
      name: "Jazmín",
      gener: "Female",
      meaning: "Flor fragante.",
      origin: "Persa",
      popularIn: "Varía según la región, popular en América Latina.",
      description: 
        'Jazmín es un nombre que evoca la belleza y la fragancia de la flor que lleva su nombre.',
      detailedDescription: 
        'Este nombre es asociado con la naturaleza y se utiliza con frecuencia en la poesía y la literatura.',
      history: 
        "El nombre Jazmín proviene de la flor del jazmín, muy valorada en muchas culturas por su aroma y belleza.",
      variants: ["Jasmin", "Yasmin"],
      famousPersons: [
        "Jazmín Espinosa (cantante)",
        "Jazmín Blesa (influencer)"
      ],
      nameDay: "21 de diciembre",
      popularity: {
        global: "Moderadamente popular",
        trend: "En aumento",
      },
    },

const nameDetails = {
      name: "Gloria",
      gener: "Female",
      meaning: "Fama, esplendor.",
      origin: "Latino",
      popularIn: "Común en muchos países de habla hispana.",
      description: 
        'Gloria es un nombre que representa el honor y la fama, con connotaciones de éxito y reconocimiento.',
      detailedDescription: 
        'Este nombre tiene una rica historia cultural y se asocia a menudo con la celebración y la victoria.',
      history: 
        "El nombre Gloria ha sido utilizado desde la antigüedad, frecuentemente en contextos religiosos y literarios.",
      variants: ["Gloriana", "Glo"],
      famousPersons: [
        "Gloria Estefan (cantante)",
        "Gloria Gaynor (cantante)"
      ],
      nameDay: "15 de agosto",
      popularity: {
        global: "Popular en el mundo hispanohablante",
        trend: "En disminución",
      },
    },

const nameDetails = {
      name: "Andrea",
      gener: "Female",
      meaning: "Valiente, mujer fuerte.",
      origin: "Griego",
      popularIn: "Común en muchos países, especialmente en Italia y España.",
      description: 
        'Andrea es un nombre que simboliza la fuerza y el coraje, y ha sido utilizado en diversas culturas con un toque de elegancia.',
      detailedDescription: 
        'Este nombre ha sido popular entre las mujeres desde hace décadas, asociado a personalidades fuertes y carismáticas.',
      history: 
        "Andrea tiene raíces griegas y ha sido utilizado desde la antigüedad, a menudo vinculado a figuras históricas y mitológicas.",
      variants: ["Andrée", "Andria"],
      famousPersons: [
        "Andrea Bocelli (cantante)",
        "Andrea Nahles (política alemana)"
      ],
      nameDay: "30 de noviembre",
      popularity: {
        global: "Muy popular en el mundo",
        trend: "Estable",
      },
    }

const nameDetails = {
    name: "Ángela",
    gener: "Female",
    significado: "Mensajera de Dios.",
    origen: "Griego",
    popularIn: "Común en países de habla hispana y en algunas regiones de Europa.",
    descripción: 'Ángela es un nombre femenino de origen griego que significa "mensajera de Dios". Es un nombre que evoca un sentido de divinidad y espiritualidad.',
    detalladaDescripción: 'El nombre Ángela ha sido muy apreciado en diversas culturas, especialmente en la tradición cristiana, donde se asocia a los ángeles como seres protectores.',
    historia: "El nombre Ángela tiene raíces en el griego 'angelos', que significa 'mensajero'. Ha sido utilizado desde la Edad Media y ha mantenido su popularidad a lo largo de los siglos.",
    variantes: ["Ángela, Angelita, Angie"],
    personas famosas: [
      "Ángela Merkel (política alemana)",
      "Ángela Carrasco (cantante)"
    ],
    nameDay: "2 de octubre",
    popularidad: {
      global: "Popular en el mundo hispanohablante y en otras culturas.",
      tendencia: "Extremadamente popular",
    },
  };
  
