[
  {
    "name": "Alejandro",
    "meaning": "Defensor de la humanidad",
    "origin": "Griego",
    "popularIn": "México, España, Colombia",
    "description": "Alejandro es un nombre masculino de origen griego que significa 'defensor de la humanidad'. Es un nombre clásico y muy popular en países hispanohablantes.",
    "detailedDescription": "El nombre Alejandro proviene del griego 'Alexandros', que combina 'alexein' (proteger) y 'andros' (hombre). Este nombre evoca valentía, liderazgo y una disposición protectora. Los hombres llamados Alejandro suelen ser percibidos como fuertes y justos.\n\nCon una larga historia, Alejandro ha sido usado por figuras notables, incluidos emperadores y líderes. A menudo, se asocia con personas carismáticas y decididas a defender lo que es justo.",
    "history": "Alejandro se popularizó gracias a Alejandro Magno, el legendario rey y conquistador de Macedonia.",
    "variants": ["Alex (inglés)", "Alessandro (italiano)"],
    "famousPersons": [
      "Alejandro Magno (rey de Macedonia)",
      "Alejandro Sanz (cantante español)"
    ],
    "nameDay": "26 de febrero",
    "popularity": {
      "global": "Popular en todo el mundo, especialmente en países de habla hispana",
      "trend": "Ha mantenido popularidad estable a lo largo de los años"
    }
  },
  {
    "name": "Carlos",
    "meaning": "Hombre libre",
    "origin": "Germánico",
    "popularIn": "España, México, Argentina",
    "description": "Carlos es un nombre de origen germánico que significa 'hombre libre'. Es un nombre clásico y de gran popularidad en la cultura hispana.",
    "detailedDescription": "El nombre Carlos tiene su origen en el término germánico 'Karl', que significa 'hombre libre'. Este nombre ha sido asociado a reyes y emperadores, lo que le otorga un toque de nobleza y respeto.\n\nLas personas llamadas Carlos son vistas como independientes, determinadas y con gran fortaleza de espíritu. El nombre sugiere una personalidad con liderazgo natural, resiliente y con una disposición noble.",
    "history": "Carlos ha sido utilizado por varios monarcas y figuras de poder, lo que lo convierte en un nombre con gran historia y prestigio.",
    "variants": ["Carl (inglés)", "Karel (checo)"],
    "famousPersons": [
      "Carlos Slim (empresario mexicano)",
      "Carlos V (emperador del Sacro Imperio Romano)"
    ],
    "nameDay": "4 de noviembre",
    "popularity": {
      "global": "Muy popular en países de habla hispana y en gran parte de Europa",
      "trend": "Ha mantenido popularidad a lo largo de los siglos"
    }
  },
  {
    "name": "Fernando",
    "meaning": "Valiente en la paz",
    "origin": "Germánico",
    "popularIn": "España, México, Chile",
    "description": "Fernando es un nombre de origen germánico que significa 'valiente en la paz'. Es un nombre fuerte y noble, muy común en países hispanohablantes.",
    "detailedDescription": "El nombre Fernando proviene del germánico 'Ferdinand', que combina 'frithu' (paz) y 'nanth' (valiente). A menudo, se asocia con personas de carácter firme y pacífico, que buscan el equilibrio y la armonía.\n\nLos hombres llamados Fernando son vistos como líderes pacíficos y justos, dispuestos a enfrentar desafíos sin perder la serenidad.",
    "history": "Fernando fue popularizado por varios monarcas españoles, lo que contribuyó a su prestigio y nobleza en la cultura hispana.",
    "variants": ["Fernand (francés)", "Ferdinand (inglés)"],
    "famousPersons": [
      "Fernando Alonso (piloto español)",
      "Fernando el Católico (rey de Aragón)"
    ],
    "nameDay": "30 de mayo",
    "popularity": {
      "global": "Popular en España y América Latina",
      "trend": "Nombre clásico, con alta popularidad histórica"
    }
  },
  {
    "name": "Manuel",
    "meaning": "Dios está con nosotros",
    "origin": "Hebreo",
    "popularIn": "México, España, Perú",
    "description": "Manuel es un nombre masculino de origen hebreo que significa 'Dios está con nosotros'. Es un nombre profundamente tradicional en muchos países hispanohablantes.",
    "detailedDescription": "El nombre Manuel deriva del hebreo 'Immanuel', que significa 'Dios está con nosotros'. Evoca devoción y espiritualidad, siendo un nombre asociado a personas de fe y sabiduría.\n\nLos hombres llamados Manuel son vistos como compasivos, empáticos y con una inclinación hacia lo espiritual. Suelen ser personas de gran fuerza interior y sensibilidad.",
    "history": "El nombre Manuel es una versión corta de Emmanuel y ha sido utilizado durante siglos en comunidades cristianas.",
    "variants": ["Emanuel (portugués)", "Emmanuel (francés)"],
    "famousPersons": [
      "Manuel García (tenor español)",
      "Manuel de Falla (compositor español)"
    ],
    "nameDay": "1 de enero",
    "popularity": {
      "global": "Popular en países de habla hispana",
      "trend": "Nombre tradicional con popularidad estable"
    }
  },
  {
    "name": "José",
    "meaning": "Aquel que agrega",
    "origin": "Hebreo",
    "popularIn": "México, España, Filipinas",
    "description": "José es un nombre de origen hebreo que significa 'aquel que agrega'. Es uno de los nombres más comunes y tradicionales en el mundo hispano.",
    "detailedDescription": "El nombre José proviene del hebreo 'Yosef', que significa 'aquel que agrega' o 'Dios aumentará'. Es un nombre asociado a la bondad, la paternidad y la devoción familiar.\n\nLas personas llamadas José suelen ser vistas como protectoras, generosas y de carácter estable. Es un nombre que evoca respeto y una personalidad confiable.",
    "history": "José es un nombre de gran tradición en la cultura cristiana, asociado a San José, el padre terrenal de Jesús.",
    "variants": ["Joseph (inglés)", "Giuseppe (italiano)"],
    "famousPersons": [
      "José Martí (poeta cubano)",
      "José Saramago (escritor portugués)"
    ],
    "nameDay": "19 de marzo",
    "popularity": {
      "global": "Extremadamente popular en países hispanohablantes",
      "trend": "Uno de los nombres masculinos más tradicionales y constantes"
    }
  },
  {
    "name": "Javier",
    "meaning": "El que vive en casa nueva",
    "origin": "Vasco",
    "popularIn": "España, México, Perú",
    "description": "Javier es un nombre masculino de origen vasco que significa 'el que vive en casa nueva'. Es popular en varias culturas hispanas.",
    "detailedDescription": "El nombre Javier proviene del vasco 'etxe berri', que significa 'casa nueva'. Este nombre evoca renovación, cambio y adaptabilidad. Las personas llamadas Javier suelen ser percibidas como dinámicas y con habilidades para adaptarse a distintas situaciones.",
    "history": "Popularizado por San Francisco Javier, misionero jesuita del siglo XVI, lo que ha contribuido a su uso en países católicos.",
    "variants": ["Xavier (francés)", "Javiero (italiano)"],
    "famousPersons": [
      "Javier Bardem (actor español)",
      "San Francisco Javier (misionero jesuita)"
    ],
    "nameDay": "3 de diciembre",
    "popularity": {
      "global": "Muy popular en España y América Latina",
      "trend": "Nombre tradicional con popularidad constante"
    }
  },
  {
    "name": "Miguel",
    "meaning": "¿Quién como Dios?",
    "origin": "Hebreo",
    "popularIn": "España, México, Colombia",
    "description": "Miguel es un nombre de origen hebreo que significa '¿Quién como Dios?'. Es un nombre clásico y popular en muchos países de habla hispana.",
    "detailedDescription": "El nombre Miguel deriva del hebreo 'Mikha'el', una exclamación de fe. Este nombre evoca fortaleza y devoción. Las personas llamadas Miguel suelen ser vistas como seguras, protectoras y con un fuerte sentido de espiritualidad.",
    "history": "Nombre tradicionalmente cristiano, asociado al arcángel San Miguel, el defensor de la fe.",
    "variants": ["Michael (inglés)", "Michele (italiano)"],
    "famousPersons": [
      "Miguel de Cervantes (escritor español)",
      "Miguel Ángel (artista renacentista)"
    ],
    "nameDay": "29 de septiembre",
    "popularity": {
      "global": "Popular en todo el mundo, especialmente en países cristianos",
      "trend": "Nombre clásico con alta popularidad histórica"
    }
  },
  {
    "name": "Luis",
    "meaning": "Guerrero famoso",
    "origin": "Germánico",
    "popularIn": "España, México, Argentina",
    "description": "Luis es un nombre masculino de origen germánico que significa 'guerrero famoso'. Es un nombre de gran popularidad en países hispanohablantes.",
    "detailedDescription": "El nombre Luis proviene del germánico 'Hludwig', que significa 'famoso por la guerra'. Este nombre evoca valentía y una personalidad con determinación. Los hombres llamados Luis son percibidos como líderes naturales y personas fuertes de espíritu.",
    "history": "El nombre fue popularizado por reyes franceses y es utilizado en muchas culturas alrededor del mundo.",
    "variants": ["Louis (francés)", "Ludwig (alemán)"],
    "famousPersons": [
      "Luis Fonsi (cantante puertorriqueño)",
      "Luis de Góngora (poeta español)"
    ],
    "nameDay": "25 de agosto",
    "popularity": {
      "global": "Extremadamente popular en el mundo occidental",
      "trend": "Nombre constante en popularidad y respeto"
    }
  },
  {
    "name": "Pedro",
    "meaning": "Roca",
    "origin": "Latín",
    "popularIn": "España, Chile, México",
    "description": "Pedro es un nombre masculino de origen latino que significa 'roca'. Es uno de los nombres más antiguos y tradicionales en el mundo cristiano.",
    "detailedDescription": "El nombre Pedro proviene del latín 'Petrus', que significa 'roca' o 'piedra'. A menudo, es visto como un nombre fuerte y estable, y las personas llamadas Pedro suelen ser percibidas como confiables y de carácter sólido.",
    "history": "Popularizado por el apóstol Pedro en el cristianismo, el nombre tiene una gran tradición religiosa.",
    "variants": ["Peter (inglés)", "Pierre (francés)"],
    "famousPersons": [
      "Pedro Almodóvar (director español)",
      "San Pedro (apóstol)"
    ],
    "nameDay": "29 de junio",
    "popularity": {
      "global": "Muy popular en países de habla hispana y Europa",
      "trend": "Nombre clásico con popularidad constante"
    }
  },
  {
    "name": "Juan",
    "meaning": "Dios es misericordioso",
    "origin": "Hebreo",
    "popularIn": "España, México, Perú",
    "description": "Juan es un nombre masculino de origen hebreo que significa 'Dios es misericordioso'. Es uno de los nombres más comunes en la cultura hispana.",
    "detailedDescription": "El nombre Juan proviene del hebreo 'Yohanan', que significa 'Dios es misericordioso'. Este nombre es asociado a una personalidad de fe y compasión. Los hombres llamados Juan suelen ser percibidos como generosos y con una profunda espiritualidad.",
    "history": "Ha sido utilizado desde la antigüedad en la tradición cristiana, especialmente popularizado por San Juan Bautista.",
    "variants": ["John (inglés)", "Jean (francés)"],
    "famousPersons": [
      "Juan Rulfo (escritor mexicano)",
      "Juan Carlos I (rey de España)"
    ],
    "nameDay": "24 de junio",
    "popularity": {
      "global": "Muy popular en todo el mundo, especialmente en países cristianos",
      "trend": "Nombre clásico y ampliamente difundido"
    }
  },
  {
    "name": "Raúl",
    "meaning": "Consejero valiente",
    "origin": "Germánico",
    "popularIn": "España, México, Argentina",
    "description": "Raúl es un nombre masculino de origen germánico que significa 'consejero valiente'. Es un nombre de tradición fuerte y confiable.",
    "detailedDescription": "El nombre Raúl proviene del germánico 'Radulf', que combina 'consejo' y 'lobo'. Es un nombre que sugiere valentía y sabiduría. Los hombres llamados Raúl son percibidos como protectores, leales y con una gran capacidad de liderazgo.",
    "history": "Se ha mantenido popular en varios países europeos y latinoamericanos a lo largo de los siglos.",
    "variants": ["Ralph (inglés)", "Rudolph (germánico)"],
    "famousPersons": [
      "Raúl González (futbolista español)",
      "Raúl Alfonsín (expresidente argentino)"
    ],
    "nameDay": "30 de octubre",
    "popularity": {
      "global": "Muy popular en países hispanohablantes y en Europa",
      "trend": "Nombre tradicional con popularidad estable"
    }
  },
  {
    "name": "Ricardo",
    "meaning": "Rey valiente",
    "origin": "Germánico",
    "popularIn": "España, México, Chile",
    "description": "Ricardo es un nombre masculino de origen germánico que significa 'rey valiente'. Es un nombre que transmite fuerza y liderazgo.",
    "detailedDescription": "El nombre Ricardo proviene del germánico 'Rikharthu', que significa 'rey valiente'. Los hombres llamados Ricardo suelen ser percibidos como líderes natos, con una personalidad fuerte y decidida.",
    "history": "Popularizado en la Edad Media, ha sido usado por varias figuras históricas en Europa.",
    "variants": ["Richard (inglés)", "Rikard (sueco)"],
    "famousPersons": [
      "Ricardo Arjona (cantante guatemalteco)",
      "Ricardo Corazón de León (rey de Inglaterra)"
    ],
    "nameDay": "3 de abril",
    "popularity": {
      "global": "Muy popular en países hispanohablantes y en Europa",
      "trend": "Nombre clásico y con una popularidad constante"
    }
  },
  {
    "name": "Sebastián",
    "meaning": "Reverenciado",
    "origin": "Griego",
    "popularIn": "Chile, Argentina, México",
    "description": "Sebastián es un nombre de origen griego que significa 'reverenciado'. Es un nombre elegante y tradicional en la cultura hispana.",
    "detailedDescription": "El nombre Sebastián proviene del griego 'Sebastos', que significa 'reverenciado'. Suele ser un nombre asociado con respeto y admiración. Las personas llamadas Sebastián suelen ser percibidas como carismáticas y respetuosas.",
    "history": "El nombre se popularizó en el cristianismo gracias a San Sebastián, un mártir y santo de gran devoción.",
    "variants": ["Sebastian (inglés)", "Sebastiano (italiano)"],
    "famousPersons": [
      "Sebastián Yatra (cantante colombiano)",
      "San Sebastián (santo cristiano)"
    ],
    "nameDay": "20 de enero",
    "popularity": {
      "global": "Muy popular en América Latina y Europa",
      "trend": "Nombre con popularidad creciente"
    }
  }
]
